function theta = Get_AngleOfTwoLine(a1,a2)
% author:bingo
%date:2016-11-1
%%%%%%%%%%%%%%%%%%%%%%%  获得两条直线之间的夹角  %%%%%%%%%%%%%%%%%%%%%%%%%%%
% 输入：a1——一条直线斜率（y=ax+b中的a）
%       a2——另一条直线斜率（y=ax+b中的a）
% 输出：theta——得到两条直线的夹角
% 函数描述：根据输入参数中的两条直线的斜率a1,a2，得到这两条直线的夹角
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% k1 = a1;
% k2 = a2;
% x = 0:0.1:10;
% y0 = 0*x;
% y1 = x*k1;
% y2 = x*k2;
% plot(x,y0,'y',x,y1,'b',x,y2,'g');
% hold on
k = abs((a1-a2)/(1+a1*a2));
% y3 = x*k3;
% plot(x,y3,'r')
% axis([0,10,-5,5])
theta = atan(k)*180/pi;
return